## Pandas 학습

### 라이브러리 추가

```python
!pip install pandas
```

- Sucessfully, Installed : 최초 설치
- Requirement already satisfied... : 이미 설치

In [ ]:
# 판다스 라이브러리 로딩
import pandas as pd

### Pandas 기본
#### DataFrame 객체
-파이썬 2차원 리스트(배열)과 동일
- 행(row) 각 하나의 유니크 데이터묶음
- 열(column) 유니크 데이터의 하나하나의 특성

In [ ]:
## 딕셔너리로 DataFrame 객체 생성 = 일반 2차원 리스트와 동일하게 생성 가능
data = {'이름':['홍길동','전요한','Sam'],'나이':[29,40,41],'결혼 여부':['True','False','True']}
df = pd.DataFrame(data)
df

In [ ]:
# 2차원 리스트 생성
data = [['홍길동',29,'대한민국','Hgd@nate.com',True],['전요한',40,'수리남','Gby@google.com',False],
        ['Sam',41,'영국','sam7138@google.com',True],['홍길순',18,'대한민국','hgs@daum.net',False]]

data

In [ ]:
# 2차원 리스트로 DataFrame 객체 생성
df = pd.DataFrame(data=data,columns=['이름','나이','국적','이메일','결혼 여부'])
df

In [ ]:
## DataFrame에서 데이터 조회(열) - 리스트는 for문을 써야지 출력가능
df['이름']

In [ ]:
## DataFrame에서 조회(두개의 열 조회)
df[['이름','나이']]

In [ ]:
## DataFrame 행으로 조회
df.loc[0]

In [ ]:
## DataFrame에서 조회(행)
df.loc[[0,2]]

In [ ]:
# 현재 DataFrame 확인 
df

In [ ]:
# 새 컬럼 추카
df['전화 번호'] = ['010','02','070','018']

In [ ]:
# 추가된 DataFrame 확인
df

In [ ]:
# 열 삭제 , axis = 0(행),1(열)
df.drop('결혼 여부',axis=1)

In [ ]:
## drop()은 삭제하고 출력만 해준다. 완전한 삭제를 위해서는 inplace 옵션을 사용해야 한다.
# inplace를 사용하면 화면에 출력이 안된다
df.drop('결혼 여부',axis=1,inplace=True)

In [ ]:
# 삭제를 확인
df

In [ ]:
df.loc[4] = ['선영',17,'대한민국','yong@gmail.com','010']

In [ ]:
df

In [ ]:
# 행 삭제
df2 = df.drop(4)

In [ ]:
df2

In [ ]:
#행 삭제 inplace
df.drop(2,inplace=True,axis=0)

In [ ]:
df

In [ ]:
# 열 이름 변경
df.rename(columns={'전화 번호':'휴대폰'}, inplace=True)

In [ ]:
df

- DataFrame은 파이썬의 2차원 리스트와 동일하지만 좀 더 사용하기 쉽도록 만든 클래스

#### 시리즈 객체

- 파이썬에서의 1차원 리스트(배열)
- 시리즈를 그루핑한게 DataFrame
- 가장 최소 단위

In [ ]:
data = [47,20,40,18,17]

srs = pd.Series(data)
srs

In [ ]:
# DataFrame의 한 열을 가지고온 자료구조와 시리즈는 동일
type(df['나이'])

In [ ]:
type(srs)

In [ ]:
srs = pd.Series(data= data,index=['홍길동','전요한','홍길순','선영은','강정택'])
srs

#### 데이터프레임 사용하기

- CSV, 엑셀파일 로드
- VS Code 플러그인, GrapeCity의 Excel Viewer를 설치
- Pandas에서 엑셀 파일을 로드할 때는 onpenpyxl 라이브러리를 설치해야 함

```python
!pip install openpyxl
```

In [86]:
## CSV 로드
df_csv = pd.read_csv('./data/sample_1.csv',encoding='utf-8',header=1,skipfooter=2,usecols=[0,1,2],engine='python')
df_csv

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [ ]:
#openpyxl 설치
#!pip install openpyxl

In [ ]:
## 엑셀 로드
df_xls = pd.read_excel('./data/sample_1.xlsx',header=1,skipfooter=2,usecols='A:C',sheet_name='Sheet1')

- 동일한 데이터라면 csv와 엑셀 중에서는 csv가 훨씬 용량이 작다

In [ ]:
type(df_csv)

In [ ]:
type(df_xls)

In [75]:
## df 정보 확인 .info()
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [74]:
df_xls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [93]:
## 데이터 일부 보기(위에서 부터)
df_csv.head(6)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [92]:
## 데이터 일부 보기(아래서 부터)
df_csv.tail(6)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [ ]:
## 통계량 요약보기
df_csv.describe()

In [100]:
df_csv['기준년월'] = ['2023-10','2023-11','2023-12','2024-01','2024-02','2024-03']

In [102]:
df_csv['기준년월'] = '2023-12'

In [103]:
df_csv

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-12
1  A01  여성  191436  2023-12
2  A31  남성     319  2023-12
3  A31  여성      42  2023-12
4  A18  남성  158912  2023-12
5  A18  여성  232943  2023-12

In [113]:
df_csv.loc[0:3]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-12
1  A01  여성  191436  2023-12
2  A31  남성     319  2023-12
3  A31  여성      42  2023-12

In [132]:
## 필터링
condition = (df_csv['국적코드'] == 'A31')

6

In [134]:
# '국적코드가 A31인 행만 보여줘'
df_csv[condition]

2

In [122]:
# 상단의 condition 변수 만드는 부분과 사용하는 부분을 합칠 수 있음
df_csv[df_csv['성별'] == '여성']

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2023-12
3  A31  여성      42  2023-12
5  A18  여성  232943  2023-12

In [129]:
#  입국 객수가 20만 이상인 행만 보여줘
df_csv[df_csv['입국객수'] >= 200000]

  국적코드  성별    입국객수     기준년월
5  A18  여성  232943  2023-12

In [131]:
df_csv[(df_csv['성별'] == '남성' )& (df_csv['입국객수'] >= 150000)]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2023-12

In [139]:
## 한 열에 여러 값으로 필터링

df_csv[df_csv['국적코드'].isin(['A01','A31']) == True]
#df_csv[df_csv['국적코드'].isin(['A01','A31']) == False]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-12
1  A01  여성  191436  2023-12
2  A31  남성     319  2023-12
3  A31  여성      42  2023-12

In [174]:
## DF에 새 열 생셩
df_csv['국적명'] = ['일본','일본','괌','괌','중국','중국']
df_csv

   index 국적코드  성별    입국객수     기준년월 국적명
0      0  A01  남성  106320  2023-12  일본
1      1  A01  여성  191436  2023-12  일본
2      2  A31  남성     319  2023-12   괌
3      3  A31  여성      42  2023-12   괌
4      4  A18  남성  158912  2023-12  중국
5      5  A18  여성  232943  2023-12  중국

In [ ]:
## DF에 인덱스를 변경
df_csv.set_index(keys='국적명')

In [158]:
# df_csv = df_csv.reset_index()

In [198]:
## 그룹화(Grouping)
## 여러 함수를 같이 사용해라 DF으로 출력됨
df_csv.groupby(['국적코드']).sum('입국객수')

        입국객수
국적코드
A01   297756
A18   391855
A31      361

In [188]:
df_csv.groupby(['국적코드']).count()

      index  성별  입국객수  기준년월  국적명
국적코드
A01       2   2     2     2    2
A18       2   2     2     2    2
A31       2   2     2     2    2

In [192]:
df_csv.groupby(['국적코드']).mean('입국객수')

# median()중앙값.min()최소값.max()최대값,std()표준편차,var()분산

          입국객수
국적코드
A01   148878.0
A18   195927.5
A31      180.5

In [ ]:
##정렬

df_csv.sort_values('입국객수',ascending=False)